
## Plan Result

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/10818596519)


<pre><code>Plan: 2 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * local_file.demo_page
  * local_file.index_page
* Update
  * aws_dynamodb_table.Link_table
  * aws_lambda_function.scan
  * aws_s3_bucket.images
  * aws_s3_bucket.website


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_dynamodb_table.Link_table will be updated in-place
  ~ resource "aws_dynamodb_table" "Link_table" {
        id               = "mtchoun-mouh-add-demo-page-again-Link_table"
        name             = "mtchoun-mouh-add-demo-page-again-Link_table"
      ~ read_capacity    = 0 -> 3
        tags             = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
      ~ write_capacity   = 0 -> 1
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.scan will be updated in-place
  ~ resource "aws_lambda_function" "scan" {
        id                             = "mtchoun-mouh-add-demo-page-again-scan_user_consulcam"
      ~ last_modified                  = "2024-09-11T18:47:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "u/KPcTcH9R7C/1WGPNpMYe3smO5Xgd7M8oPtFZ5ID8I=" -> "tuhLhds4xGDVEbFq4I7/sMEANrz0Ke/A6GJ247L0tNA="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "USERS_TABLE"     = "Users" -> "mtchoun-mouh-add-demo-page-again-Users"
                # (8 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-add-demo-page-again-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (11 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-add-demo-page-again-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (13 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.demo_page will be created
  + resource "local_file" "demo_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/demo.html"
      + id                   = (known after apply)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 2 to add, 4 to change, 0 to destroy.

```

</details>




<!-- github-comment: {"Command":"plan","JobName":"deploy","PRNumber":196,"Program":"tfcmt","SHA1":"11bbc8901ce7e7edc4eed482a05d65726552f62e","Vars":{},"WorkflowName":"Deploy cases"} -->